In [3]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

## Importamos nuestro csv 'rental' para chequeo de valores nulos y duplicados

In [76]:
data_ori = pd.read_csv('/Users/christelllameda/ironhack/Proyecto-Nro-2/data/csv_originales/rental.csv', encoding='latin1')

data = data_ori.copy()

In [77]:
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [78]:
nan_cols = data.isna().sum()

nan_cols[nan_cols>0]

Series([], dtype: int64)

## La columna last_update posee los mismos valores para todas las filas, por lo que no es relevante y la eliminamos

In [79]:
data = data.drop(columns=['last_update'])

## Chequeamos que no hay duplicados

In [80]:
data.duplicated().any()

False

## Convertimos los valores de las columnas 'rental_date' y 'return_date' en formato datetime para poder restarlos y saber la cantidad de días que alquiló un cliente una película.

## Este valor lo guardaremos en una columna nueva llamada 'rental_duration' que luego nos servirá para saber el costo de ese alquiler

In [81]:
data['rental_date'] = pd.to_datetime(data['rental_date'])
data['return_date'] = pd.to_datetime(data['return_date'])

data['rental_duration'] = data['return_date'] - data['rental_date']
data['rental_duration'] = data['rental_duration'].dt.days

## Agregamos una nueva columna 'day_of_week' para poder conocer el día de la semana que se realizó el alquiler de la película

In [82]:
data['day_of_week'] = data['rental_date'].dt.strftime('%A')
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,rental_duration,day_of_week
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,1,Tuesday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,3,Tuesday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,7,Tuesday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,9,Tuesday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,8,Tuesday

## Reorganizamos el orden de nuestras columnas

In [85]:
nuevo_orden = ['rental_id', 'inventory_id', 'rental_date','day_of_week','return_date','rental_duration','customer_id', 'staff_id']
data = data[nuevo_orden]
data.head(10)

,rental_id,inventory_id,rental_date,day_of_week,return_date,rental_duration,customer_id,staff_id
0,1,367,2005-05-24 22:53:30,Tuesday,2005-05-26 22:04:30,1,130,1
1,2,1525,2005-05-24 22:54:33,Tuesday,2005-05-28 19:40:33,3,459,1
2,3,1711,2005-05-24 23:03:39,Tuesday,2005-06-01 22:12:39,7,408,1
3,4,2452,2005-05-24 23:04:41,Tuesday,2005-06-03 01:43:41,9,333,2
4,5,2079,2005-05-24 23:05:21,Tuesday,2005-06-02 04:33:21,8,222,1
5,6,2792,2005-05-24 23:08:07,Tuesday,2005-05-27 01:32:07,2,549,1
6,7,3995,2005-05-24 23:11:53,Tuesday,2005-05-29 20:34:53,4,269,2
7,8,2346,2005-05-24 23:31:46,Tuesday,2005-05-27 23:33:46,3,239,2
8,9,2580,2005-05-25 00:00:40,Wednesday,2005-05-28 00:22:40,3,126,1
9,10,1824,2005-05-25 00:02:21,Wednesday,2005-05-31 22:44:21,6,399,2

## Exportamos nuestro archivo limpio

In [88]:
data.to_csv('rental_clean.csv', index=False)